src/Plugins/Nop.Plugin.Shipping.UPS/Web References/track/Track.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:trk="http://www.ups.com/XMLSchema/XOLTWS/Track/v2.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" xmlns:tns="http://www.ups.com/WSDL/XOLTWS/Track/v2.0" xmlns:error="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="Track" targetNamespace="http://www.ups.com/WSDL/XOLTWS/Track/v2.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="UPSSecurity.xsd" namespace="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0" />
      <xsd:import schemaLocation="Error1.1.xsd" namespace="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1" />
      <xsd:import schemaLocation="TrackWebServiceSchema.xsd" namespace="http://www.ups.com/XMLSchema/XOLTWS/Track/v2.0" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="TrackRequestMessage">
    <wsdl:part name="Body" element="trk:TrackRequest" />
    <wsdl:part name="UPSSecurity" element="upss:UPSSecurity" />
  </wsdl:message>
  <wsdl:message name="TrackResponseMessage">
    <wsdl:part name="Body" element="trk:TrackResponse" />
  </wsdl:message>
  <wsdl:message name="TrackErrorMessage">
    <wsdl:part name="TrackError" element="error:Errors" />
  </wsdl:message>
  <wsdl:portType name="TrackPortType">
    <wsdl:operation name="ProcessTrack">
      <wsdl:input name="TrackRequest" message="tns:TrackRequestMessage" />
      <wsdl:output name="TrackResponse" message="tns:TrackResponseMessage" />
      <wsdl:fault name="TrackError" message="tns:TrackErrorMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="TrackBinding" type="tns:TrackPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="ProcessTrack">
      <soap:operation soapAction="http://onlinetools.ups.com/webservices/TrackBinding/v2.0" style="document" />
      <wsdl:input name="TrackRequest">
        <soap:body use="literal" parts="Body" />
        <soap:header message="tns:TrackRequestMessage" part="UPSSecurity" use="literal">
          <soap:headerfault message="tns:TrackErrorMessage" part="TrackError" use="literal" />
        </soap:header>
      </wsdl:input>
      <wsdl:output name="TrackResponse">
        <soap:body use="literal" parts="Body" />
      </wsdl:output>
      <wsdl:fault name="TrackError">
        <soap:fault use="literal" name="TrackError" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="TrackService">
    <wsdl:port name="TrackPort" binding="tns:TrackBinding">
      <soap:address location="https://wwwcie.ups.com/webservices/Track" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>