XOLTResult.xml

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Track/v2.0" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>fayeishere</ns3:Username><ns3:Password>OOly2pdx!!</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>6CE5F136EA9F2636</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:TrackRequest><ns1:Request><ns1:RequestOption>15</ns1:RequestOption><ns1:TransactionReference><ns1:CustomerContext>Add description here</ns1:CustomerContext></ns1:TransactionReference></ns1:Request><ns2:InquiryNumber>576235903</ns2:InquiryNumber><ns2:TrackingOption>02</ns2:TrackingOption></ns2:TrackRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><trk:TrackResponse xmlns:trk="http://www.ups.com/XMLSchema/XOLTWS/Track/v2.0"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus><common:TransactionReference><common:CustomerContext>Add description here</common:CustomerContext></common:TransactionReference></common:Response><trk:Shipment><trk:InquiryNumber><trk:Code>PRO</trk:Code><trk:Description>PRO Number</trk:Description><trk:Value>576235903</trk:Value></trk:InquiryNumber><trk:ShipmentType><trk:Code>02</trk:Code><trk:Description>Freight</trk:Description></trk:ShipmentType><trk:ShipmentAddress><trk:Type><trk:Code>02</trk:Code><trk:Description>ShipTo Address</trk:Description></trk:Type><trk:Address><trk:City>COMMERCE</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode><trk:PostalCode>90040</trk:PostalCode><trk:CountryCode>US</trk:CountryCode></trk:Address></trk:ShipmentAddress><trk:ShipmentWeight><trk:UnitOfMeasurement><trk:Code>LBS</trk:Code></trk:UnitOfMeasurement><trk:Weight>240</trk:Weight></trk:ShipmentWeight><trk:Service><trk:Code>308</trk:Code><trk:Description>UPS Freight LTL</trk:Description></trk:Service><trk:ReferenceNumber><trk:Code>PO</trk:Code><trk:Description>PO Number</trk:Description><trk:Value>00847009611591</trk:Value></trk:ReferenceNumber><trk:ReferenceNumber><trk:Code>BL</trk:Code><trk:Description>Bill Of Landing</trk:Description><trk:Value>MS008</trk:Value></trk:ReferenceNumber><trk:CurrentStatus><trk:Code>011</trk:Code><trk:Description>Delivered</trk:Description></trk:CurrentStatus><trk:PickupDate>20150106</trk:PickupDate><trk:ServiceCenter><trk:Type><trk:Code>01</trk:Code><trk:Description>Delivery Service Center</trk:Description></trk:Type><trk:Address><trk:City>Commerce</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:Address></trk:ServiceCenter><trk:ServiceCenter><trk:Type><trk:Code>03</trk:Code><trk:Description>Pickup Service Center</trk:Description></trk:Type><trk:Address><trk:City>Commerce</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:Address></trk:ServiceCenter><trk:ServiceCenter><trk:Type><trk:Code>02</trk:Code><trk:Description>Estimated Delivery Service Center</trk:Description></trk:Type><trk:Address><trk:City>Commerce</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:Address></trk:ServiceCenter><trk:DeliveryDetail><trk:Type><trk:Code>01</trk:Code><trk:Description>Delivery</trk:Description></trk:Type><trk:Date>20150108</trk:Date><trk:Time>115700</trk:Time></trk:DeliveryDetail><trk:DeliveryDetail><trk:Type><trk:Code>02</trk:Code><trk:Description>Estimated Delivery</trk:Description></trk:Type><trk:Date>20150108</trk:Date><trk:Time>235900</trk:Time></trk:DeliveryDetail><trk:BillToName>SIRIO</trk:BillToName><trk:NumberOfPackagingUnit><trk:Type><trk:Code>01</trk:Code><trk:Description>Piece</trk:Description></trk:Type><trk:Value>2</trk:Value></trk:NumberOfPackagingUnit><trk:COD><trk:Amount><trk:CurrencyCode>USD</trk:CurrencyCode><trk:MonetaryValue>0</trk:MonetaryValue></trk:Amount></trk:COD><trk:Activity><trk:ActivityLocation><trk:City>Commerce</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Shipment has been delivered to consignee</trk:Description><trk:Date>20150108</trk:Date><trk:Time>115700</trk:Time><trk:Trailer>929539</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>Commerce</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Out for Delivery</trk:Description><trk:Date>20150108</trk:Date><trk:Time>083100</trk:Time><trk:Trailer>929539</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>Commerce</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Shipment has arrived at a Service Center</trk:Description><trk:Date>20150107</trk:Date><trk:Time>083400</trk:Time><trk:Trailer>294322</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>Kettleman City</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Departure</trk:Description><trk:Date>20150107</trk:Date><trk:Time>043800</trk:Time><trk:Trailer>294322</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>Kettleman City</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Shipment has arrived at a Service Center</trk:Description><trk:Date>20150107</trk:Date><trk:Time>022700</trk:Time><trk:Trailer>269680</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>San Leandro</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Departure</trk:Description><trk:Date>20150106</trk:Date><trk:Time>225200</trk:Time><trk:Trailer>269680</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>San Leandro</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Shipment is at a UPS Freight location</trk:Description><trk:Date>20150106</trk:Date><trk:Time>155300</trk:Time><trk:Trailer>927253</trk:Trailer></trk:Activity><trk:Activity><trk:ActivityLocation><trk:City>San Leandro</trk:City><trk:StateProvinceCode>CA</trk:StateProvinceCode></trk:ActivityLocation><trk:Description>Shipment has been picked up</trk:Description><trk:Date>20150106</trk:Date><trk:Time>150200</trk:Time><trk:Trailer>927253</trk:Trailer></trk:Activity></trk:Shipment></trk:TrackResponse></soapenv:Body></soapenv:Envelope>
